var map = [["名字", "数据1", "数据2", "数据3"], ["遇境", "8093924471530742083", "6644577", "1729382256910270464", "-768833570"], ["晨岛", "1853317444", "0", "1729382256910270464", "1649439303"], ["晨岛沙漠", "1853317444", "0", "1729382256910270464", "1649439303"], ["预言季节", "7311137987326599492", "0", "1729382256910270464", "748712866"], ["水之试炼", "7598228290179391812", "8243122654399392865", "1729382256910270464", "-410824576"], ["土之试炼", "7598228290179391812", "7526766639345527905", "1729382256910270464", "1887730855"], ["风之试炼", "7598228290179391812", "125796395215969", "1729382256910270464", "2050064391"], ["火之试炼", "7598228290179391812", "28554769126878305", "1729382256910270464", "1241316521"], ["云野一图", "6874016346366112336", "7811056383791756610", "32480039042369145", "-1817621630"], ["云野左图", "6874016346366112336", "1702256963", "1729382256910270464", "-1050035699"], ["云野右图", "6874016346366112336", "5432588277921310030", "1729382748238407013", "312004957"], ["云野圣岛", "6874016346366112336", "110425243677513", "1729382256910270464", "-1237641587"], ["云野三塔", "6874016346366112336", "28542640776309078", "1729382256910270464", "-1944435120"], ["云野八人", "7008553700985233732", "25974", "1729382256910270464", "-1900248111"], ["云野终点", "110424774762820", "0", "1729382256910270464", "1190972738"], ["雨林门口", "1852399954", "0", "1729382256910270464", "164626931"], ["飞翔季节", "133459523234643", "0", "1729382256910270464", "2081768701"], ["重组季节", "8313999364744372562", "482871427941", "1729382256910270464", "-977706424"], ["雨林二图", "7310027493466530130", "29811", "1729382256910270464", "-1455381650"], ["雨林右图", "7810763836287967570", "7497076", "1729382256910270464", "-1574275404"], ["雨林地洞", "8530173246369784146", "101", "1729382256910270464", "-161371567"], ["雨林四塔", "28263278956863826", "0", "1729382256910270464", "-2135324521"], ["雨林终点", "28268742155264338", "0", "1729382256910270464", "128844448"], ["霞谷门口", "127979077137747", "0", "1729382256910270464", "1638008359"], ["滑雪赛道", "7012795548846421331", "25955", "1729382256910270464", "571720490"], ["霞光之城", "4854726902405821779", "119182731605097", "1729382256910270464", "-2115418256"], ["飞行赛道", "5070899684519605587", "111477508962668", "1729382256910270464", "1844499196"], ["赛道尽头", "7945885096642245971", "100", "1729382256910270464", "263580627"], ["霞谷圆盘", "8017379740726752595", "30809851050553196", "1729382256910270464", "-1934656620"], ["霞谷终点", "7945885096642245971", "12900", "1729382256910270464", "507487826"], ["圆梦村", "7590382201056687443", "435526134892", "1729382256910270464", "1759178769"], ["雪隐峰", "6439993971240236371", "30243584794522725", "1729382256910270464", "649101397"], ["梦想剧场", "6079706001050596691", "125780069803368", "1729382256910270464", "1612139937"], ["表演季节", "6079706001050596691", "125780069803368", "0", "1612139937"], ["音乐商店", "7590382201056687443", "8452516964775062636", "31647691257899379", "1323747701"], ["欧若拉景点-呼气吸气", "8232966547482965573", "7308323396637777778", "1080975426734026313", "-1515235910"], ["欧若拉景点-鸟", "8232966547482965573", "7306337665485660018", "1080863910568919140", "2093785354"], ["欧若拉景点-水母", "8232966547482965573", "7947011000775171954", "1080863912269998451", "1661095040"], ["墓土门口", "8241996694698554692", "116", "1729382256910270464", "817373972"], ["藏宝岛礁", "7598228290128803140", "435610414689", "1729382256910270464", "-224855659"], ["墓土二图", "1802728772", "0", "1729382256910270464", "1147491976", "1147491976"], ["墓土方舟", "7598523990037198148", "115", "1729382256910270464", "170656205"], ["墓土五龙", "8530224820287403332", "431415720293", "1729382256910270464", "864432821"], ["墓土沉船", "7021748846127707460", "110416720643682", "1729382256910270464", "-1644045427"], ["墓土终点", "28268742105593156", "0", "1729382256910270464", "-136010643"], ["远古战场", "28263278907192644", "0", "1729382256910270464", "1597085778"], ["禁阁门口", "499967813966", "0", "1729382256910270464", "-1936060159"], ["禁阁地下室", "7165861925323499854", "1702259048", "1729382256910270464", "2518601"], ["禁阁四层", "55475549202766", "0", "1729382256910270464", "-1987505335"], ["王子季节", "8315127553767991630", "7631461", "1729382256910270464", "2060214456"], ["王子罐子", "7010520723528051022", "435777782642", "1729382256910270464", "-1036005362"], ["办公室图", "7163369271911991124", "101", "1729382256910270464", "295816905"], ["沉船海滩", "8315127553767991630", "7161116218239513189", "792633534417207400", "-1243448568"], ["禁阁终点", "7236798017501096270", "0", "1729382256910270464", "-2027781754"], ["庇护所", "7517457156583942478", "491328400485", "1080863910568919040", "-1395176541"], ["暴风门口", "7022329448513893459", "29810", "1729382256910270464", "-1184245578"], ["暴风二图", "470071342163", "0", "1729382256910270464", "1705189686"], ["伊甸献祭", "7236797987604624467", "0", "1729382256910270464", "-815180717"], ["重生城堡", "7235399438727017039", "0", "1729382256910270464", "-857831781"], ["重生二图", "7236798017517548111", "0", "1729382256910270464", "567986524"], ["星光大道", "8093924471530742083", "110424773452641", "1729382256910270464", "-2043682661"], ["重生动画", "32497618326483523", "0", "1729382256910270464", "261807733"], ["重生门", "32497618326483523", "0", "1729382256910270464", "261807733"], ["伊甸", "7236797987604624467", "0", "1729382256910270464", "-815180717"], ["星光大道", "8093924471530742083", "110424773452641", "1729382256910270464", "-2043682661"], ["万圣节", "7008831873768322629", "7166187213226472313", "1717922152", "-1212213378"], ["小王子的梦", "8315127553767991630", "7953757509367657061", "1729382256917836901", "-1470196160"], ["超级玛丽", "8026661817905211726", "6009328456400192351", "1729382258611282288", "-2095104762"], ["破晓季", "7311107381456237651", "6009043729730466926", "1701011824", "-366570631"], ["演唱会", "8017379740726752595", "30809851050553196", "1080863910568919040", "263580627"], ["拾光季-云峰", "6874016346366112336", "7306643222278465879", "1802658128", "-865844794"], ["小镇-云巢", "7310033046859243853", "29797", "0", "1509719447"], ["小镇-服装店", "7310033046859243853", "5724197620253946981", "126943821722741", "1563891948"], ["小镇-大耳狗代币", "7310033046859243853", "28541540575966309", "0", "1444818677"]];

var Wingid=[
["-768833570","遇境","l_CandleSpace_0"],
["1649439303","晨岛","l_Dawn_0","l_Dawn_1","l_Dawn_2","l_Dawn_3","l_Dawn_4","l_Dawn_TrialsWater_0","l_Dawn_TrialsEarth_0","l_Dawn_TrialsAir_0","l_Dawn_TrialsFire_0"],
["-1817621630","云野一图","l_Prairie_ButterflyFields_0","l_Prairie_ButterflyFields_1","l_Prairie_ButterflyFields_2"],
["-1944435120","云野二图","l_Prairie_Village_0","l_Prairie_Village_1","l_Prairie_Village_2","l_Prairie_Village_3","l_Prairie_Village_4"],
["-1050035699","云野左图","l_Prairie_Cave_0","l_Prairie_Cave_1"],
["312004957","云野右图","l_Prairie_NestAndKeeper_0","l_Prairie_NestAndKeeper_1"],
["-1237641587","圣岛","l_Prairie_Island_0","l_Prairie_Island_1","l_Prairie_Island_2","l_Prairie_Island_3","l_Prairie_Island_4","l_Prairie_Island_5","l_Prairie_Island_6","l_Prairie_Island_7"],
["-1900248111","云野八人门","l_DayHubCave_0"],
["164626931","雨林一图","l_Rain_0","l_Rain_1"],
["-1455381650","雨林二图","l_RainForest_0","l_RainForest_1","l_RainForest_2","l_RainForest_3"],
["-1574275404","雨林隐藏图","l_RainShelter_0","l_RainShelter_1"],
["-161371567","雨林地底隐藏图","l_Rain_Cave_0","l_Rain_Cave_1","l_Rain_Cave_2","l_Rain_Cave_3"],
["-2135324521","雨林水母图","l_RainMid_0","l_RainMid_1","l_RainMid_2"],
["128844448","雨林宫殿","l_RainEnd_0"],
["-977706424","大树屋","l_Rain_BaseCamp_0","l_Rain_BaseCamp_1"],
["1638008359","霞谷一图","l_Sunset_0","l_Sunset_1","l_Sunset_2"],
["-2115418256","霞光城","l_Sunset_Citadel_0","l_Sunset_Citadel_1"],
["1844499196","霞谷飞行赛道","l_Sunset_FlyRace_0","l_Sunset_FlyRace_1"],
["571720490","霞谷地面赛道","l_SunsetRace_0"],
["-1934656620","霞谷终点","l_SunsetEnd_0"],
["263580627","赛道终点","l_SunsetColosseum_0"],
["507487826","霞谷宫殿","l_SunsetEnd2_0"],
["1759178769","圆梦村","l_SunsetVillage_0","l_SunsetVillage_1","l_SunsetVillage_2"],
["649101397","雪隐峰","l_Sunset_YetiPark_0","l_Sunset_YetiPark_1"],
["1147491976","墓土二图","l_Dusk_0","l_Dusk_1"],
["170656205","遗忘方舟","l_DuskOasis_0","l_DuskOasis_1"],
["864432821","墓土五龙图","l_DuskGraveyard_0","l_DuskGraveyard_1","l_DuskGraveyard_2","l_DuskGraveyard_3","l_DuskGraveyard_4","l_DuskGraveyard_5"],
["-1644045427","墓土沉船图","l_Dusk_CrabField_0","l_Dusk_CrabField_1","l_Dusk_CrabField_2"],
["1597085778","墓土远古战场","l_DuskMid_0","l_DuskMid_1"],
["-136010643","墓土宫殿","l_DuskEnd_0"],
["-1936060159","禁阁低层","l_Night_0","l_Night_1"],
["2518601","禁阁地下室","l_NightArchive_0","l_NightArchive_1"],
["-1987505335","禁阁高层","l_Night2_0","l_Night2_1","l_Night2_2","l_Night2_3"],
["-1184245578","暴风一图","l_StormStart_0"],
["1705189686","暴风二图","l_Storm_0","l_Storm_1","l_Storm_2","l_Storm_3","l_Storm_4","l_Storm_5","l_Storm_6","l_Storm_7","l_Storm_8"],
["2060214456","星漠","l_NightDesert_0","l_NightDesert_1","l_NightDesert_2"],
//新增
["-865844794","云峰(拾光季)","l_Prairie_WildLifePark_0", "l_Prairie_WildLifePark_1", "l_Prairie_WildLifePark_2"],
["2081768701","风行网道","l_Skyway_0"],
["1612139937","乡村剧院","l_Sunset_Theater_0"],
["-224855659","藏宝岛礁","l_Dusk_Triangle_0", "l_Dusk_Triangle_1"],
//["l_Night_Shelter_0"],
["-366570631","破碎季地图","l_StormEvent_VoidSpace_0", "l_StormEvent_VoidSpace_1", "l_StormEvent_VoidSpace_2", "l_StormEvent_VoidSpace_3", "l_StormEvent_VoidSpace_4", "l_StormEvent_VoidSpace_5"],
["261807733","结尾动画","l_Credits_0"],
];
function yujing() {renyimen(1);}  //遇境
function cd() {renyimen(2);} //晨岛
function yyj() {renyimen(4);}//预言季
function ssl() {renyimen(5);}//水试炼
function tsl() {renyimen(6);}//土试炼
function fsl() {renyimen(7);} //风试炼
function hsl() {renyimen(8);} //火试炼
function yyyit() {renyimen(9);} //云野一图
function yyzt()  {renyimen(10);} //云野左图
function yyyout(){renyimen(11);} //云野右图
function sdj()  {renyimen(12);} //圣岛季
function yystt(){renyimen(13);} //云野三塔
function yybrm(){renyimen(14);} //云野八人门
function yyzd() {renyimen(15);} //云野终点
function ylmk() {renyimen(16);} //雨林门口
function fxj()  {renyimen(17);} //飞翔季
function czj()  {renyimen(18);} //重组季
function ylet() {renyimen(19);} //雨林二图
function ylyt() {renyimen(20);} //雨林右图
function yldd() {renyimen(21);} //雨林地洞
function ylst() {renyimen(22);} //雨林四塔
function ylzd() {renyimen(23);} //雨林终点
function xgmk() {renyimen(24);} //霞谷门口
function hxsd() {renyimen(25);} //滑雪赛道
function xgzc() {renyimen(26);} //霞光城
function fxsd() {renyimen(27);} //飞行赛道
function sdjt() {renyimen(28);} //赛道尽头
function xgyp() {renyimen(29);} //霞谷圆盘
function xgzd() {renyimen(30);} //霞谷终点
function mxj()  {renyimen(31);} //梦想季
function xrjl() {renyimen(32);} //雪人家里
function mxjc() {renyimen(33);} //梦想剧场
function byj()  {renyimen(34);} //表演季
function yysd() {renyimen(35);} //音乐商店
function orl1() {renyimen(36);} //欧若拉1
function orl2() {renyimen(37);} //欧若拉2
function orl3() {renyimen(38);} //欧若拉3
function mtmk() {renyimen(39);} //暮土门口
function shj()  {renyimen(40);} //深海季
function mtet() {renyimen(41);} //暮土二图
function mfj()  {renyimen(42);} //魔法季
function mtwl() {renyimen(43);} //暮土五龙
function mtcc() {renyimen(44);} //暮土沉船
function mtzd() {renyimen(45);} //暮土终点
function mtzc() {renyimen(46);} //暮土战场
function jgmk() {renyimen(47);} //禁阁门口
function jgms() {renyimen(48);} //禁阁密室
function jgsc() {renyimen(49);} //禁阁四层
function xwzj() {renyimen(50);} //小王子季
function wzgz() {renyimen(51);} //王子罐子
function bgs()  {renyimen(52);} //办公室
function wzcc() {renyimen(53);} //王子沉船
function jgzd() {renyimen(54);} //禁阁终点
function zyj()  {renyimen(55);} //追忆季
function bfmk() {renyimen(56);} //暴风眼门口
function bfet() {renyimen(57);} //暴风二图
function ydxj() {renyimen(58);} //伊甸献祭
function cscb() {renyimen(59);} //重生城堡
function cset() {renyimen(60);} //重生二图
function xgdd() {renyimen(61);} //星光大道
function csdh() {renyimen(62);} //重生动画
function csm() {renyimen(63);} //重生门
function yd()  {renyimen(64);} //伊甸
function xh()  {renyimen(65);} //星河
function wsj() {renyimen(66);} //万圣节
function wzxq(){renyimen(67);} //小王子星球
function mla() {renyimen(68);} //马里奥
function psj() {renyimen(69);} //破碎季
function ych() {renyimen(70);} //演唱会
function sgj() {renyimen(71);} //拾光季
function xzyc(){renyimen(72);} //小镇云鄛
function fzt() {renyimen(73);} //服装店
function dge(){renyimen(74);} //大狗耳
